Description: "Builds Docker Desktop.pkg using the upstream recipe, then uploads to Fleet."
Identifier: com.github.fleet.direct.DockerDesktop
Input:
  NAME: Docker Desktop
  SELF_SERVICE: true
  AUTOMATIC_INSTALL: false
  CATEGORIES:
  - Developer tools
MinimumVersion: "2.3"
ParentRecipe: com.github.homebysix.pkg.DockerDesktop
Process:
- Arguments:
    pkg_path: "%pkg_path%"
    software_title: "%NAME%"
    version: "%version%"
    fleet_api_base: "%FLEET_API_BASE%"
    fleet_api_token: "%FLEET_API_TOKEN%"
    team_id: "%FLEET_TEAM_ID%"
    self_service: "%SELF_SERVICE%"
    automatic_install: "%AUTOMATIC_INSTALL%"
    categories: "%CATEGORIES%"
  Processor: com.github.fleet.FleetImporter/FleetImporter
