Description: "Builds GitHub Desktop.pkg using the upstream recipe, then uploads to Fleet."
Identifier: com.github.fleet.direct.GithubDesktop
Input:
  NAME: GitHub Desktop
  SELF_SERVICE: true
  AUTOMATIC_INSTALL: false
  CATEGORIES:
  - Developer tools
  ICON: GithubDesktop.png
MinimumVersion: "2.3"
ParentRecipe: com.github.homebysix.pkg.GitHubDesktop
Process:
- Arguments:
    pkg_path: "%pkg_path%"
    software_title: "%NAME%"
    version: "%version%"
    fleet_api_base: "%FLEET_API_BASE%"
    fleet_api_token: "%FLEET_API_TOKEN%"
    team_id: "%FLEET_TEAM_ID%"
    self_service: "%SELF_SERVICE%"
    automatic_install: "%AUTOMATIC_INSTALL%"
    categories: "%CATEGORIES%"
    icon: "%ICON%"
  Processor: com.github.fleet.FleetImporter/FleetImporter
